app/Helpers/custom_helper.php

function check_ikuti_kelas()
{
    $M_Akun = new \App\Models\M_Akun();
    $user = $M_Akun->find(session()->get('id_user'));
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '60'