app/Controllers/KelolaUser.php

    public function index()
    {
        $session = session();

        // Ambil data user dari session
        $userData = [
            'username' => $session->get('username'),
            'leveluser' => $session->get('leveluser'),
            'email' => $session->get('email'),
            'telepon' => $session->get('telepon'),
            'ikutikelas' => $session->get('ikutikelas'),
            'status' => $session->get('status'),
            'nama' => $session->get('nama'),
            'ttl' => $session->get('ttl'),
            'alamat' => $session->get('alamat'),
            'pekerjaan' => $session->get('pekerjaan'),
            'instansi' => $session->get('instansi'),
            'bidang' => $session->get('bidang'),
            'manfaat' => $session->get('manfaat')
        ];

        $data = [
            'title' => 'Kelola User',
            'userData' => $userData,
            'user' => $this->UserModel->findAll(),
---
SELECT *
FROM `user`