app/Controllers/Kuesioner_p.php

SELECT *
FROM `user`
WHERE `user`.`id_user` = '59'
SELECT *
FROM `kuesioner`
---
    public function tampilKuesionerPengguna()
    {
        $M_Profil = new M_Profil();
        $M_Kuesioner = new M_Kuesioner();
        $M_Respon = new M_Respon();
        $M_User = new M_Akun();

        $id_user = session('id_user');
        $user = $M_User->find($id_user);
        $hasFilled = $M_Respon->where('id_user', $id_user)->countAllResults() > 0;

        return view('v_kuesioner_p', [
            'user' => $M_Profil->getDataProfil($id_user),
            'kuesioner' => $M_Kuesioner->findAll(),
            'hasFilled' => $hasFilled
        ]);