app/Controllers/Kuesioner.php

    public function index()
    {

        $M_Profil = new M_Profil();
        $M_Kuesioner = new M_Kuesioner();

        $M_User = new M_Akun();
        $user = $M_User->find(session('id_user'));

        if ($user['leveluser'] == 'Pengguna') {
            return view('v_kuesioner_p', [
                'user' => $M_Profil->getDataProfil(1),
                'kuesioner' => $M_Kuesioner->findAll(),
            ]);


        } else {
            return view('v_kuesioner', [
                'user' => $M_Profil->getDataProfil(1),
                'kuesioner' => $M_Kuesioner->findAll(),
            ]);
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '62'
SELECT *
FROM `kuesioner`