app/Controllers/Pengguna.php

    public function index(): string
    {

        $session = session();
        $id_user = $session->get('id_user');

        $user = $this->akunModel->where('id_user', $id_user)->first();
---
SELECT *
FROM `user`
WHERE `id_user` = '60'
 LIMIT 1