app/Models/M_Interaktif.php

SELECT *
FROM `interaktif`
---
    public function getInteraktif($id_interaktif = null)
    {
        if ($id_interaktif === null) {
            return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `interaktif`
---
    public function jumlah_interaktif()
    {
        return $this->countAll();