app/Models/M_Kelas.php

SELECT COUNT(*) AS `numrows` FROM `kelas`
---
    public function jumlah_kelas()
    {
        return $this->countAll();

SELECT *
FROM `kelas`
---
    public function getKelas($id_kelas = null)
    {
        if ($id_kelas === null) {
            return $this->findAll();