app/Models/M_Profil.php

    public function getDataProfil($id_user)
    {
        return $this->where('id_user', $id_user)->first(); // Mengambil data berdasarkan id_user
---
SELECT *
FROM `user`
WHERE `id_user` = '60'
 LIMIT 1