app/Models/M_Story.php

SELECT *
FROM `story`
---
    public function getstory($id_story = null)
    {
        if ($id_story === null) {
            return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `story`
---
    public function jumlah_story()
    {
        return $this->countAll();