app/Models/StatusBacaModel.php

    public function getStatusBaca()
    {
        return $this->select('user.username, user.email, user.leveluser,
                          kelas.judul AS judul_kelas, story.judul AS judul_story,
                          status_baca.status, status_baca.waktu_baca')
            ->join('user', 'user.id_user = status_baca.id_user', 'left')
            ->join('kelas', 'kelas.id_kelas = status_baca.id_kelas', 'left')
            ->join('story', 'story.id_story = status_baca.id_story', 'left')
            ->orderBy('status_baca.waktu_baca', 'DESC')
            ->findAll();
---
SELECT `user`.`username`, `user`.`email`, `user`.`leveluser`, `kelas`.`judul` AS `judul_kelas`, `story`.`judul` AS `judul_story`, `status_baca`.`status`, `status_baca`.`waktu_baca`
FROM `status_baca`
LEFT JOIN `user` ON `user`.`id_user` = `status_baca`.`id_user`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `status_baca`.`id_kelas`
LEFT JOIN `story` ON `story`.`id_story` = `status_baca`.`id_story`
ORDER BY `status_baca`.`waktu_baca` DESC